src/InformationRegisters/USAC_СоответствиеОбъектовИдентификаторам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>USAC_СоответствиеОбъектовИдентификаторам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДоступнаПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПроизвольныйОбъект</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>10</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеЗначения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.USAC_ВидыПроизвольныхОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.USAC_ИдентификаторыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УникальныйИдентификатор</Name>
					<Comment>Служебное поле</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/USAC_ВидыПроизвольныхОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>USAC_ВидыПроизвольныхОбъектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СсылочныйОбъект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ХранилищеЗначения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПримитивныеДанные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/InformationRegisters/USAC_СоответствиеОбъектовИдентификаторам/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработкаСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заоплнение служебной информации
	ПримитивныеДанные = Перечисления.USAC_ВидыПроизвольныхОбъектов.ПримитивныеДанные;
	СсылочныйОбъект = Перечисления.USAC_ВидыПроизвольныхОбъектов.СсылочныйОбъект;
	ХранилищеЗначения = Перечисления.USAC_ВидыПроизвольныхОбъектов.ХранилищеЗначения;
	
	// Проверка на заполненность идентификатора
	ПустойИдентификатор = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	
	Если Не(ЗначениеЗаполнено(Запись.УникальныйИдентификатор))
		ИЛИ Запись.УникальныйИдентификатор = ПустойИдентификатор Тогда 
		Запись.УникальныйИдентификатор = Новый УникальныйИдентификатор();
	КонецЕсли;
	
	// Загрузка раннее сохраненных значений
	Если Запись.ВидОбъекта = ПримитивныеДанные Тогда 
		ПримитывныеДанныеЗначение = Запись.ПроизвольныйОбъект;
	ИначеЕсли Запись.ВидОбъекта = СсылочныйОбъект Тогда 
		СсылочныйОбъектЗначение = Запись.ПроизвольныйОбъект;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьДанныхПроизвольноОбъекта();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОбъектаПриИзменении(Элемент)
	
	УстановитьВидимостьДанныхПроизвольноОбъекта();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПроизвольныйОбъектПриИзменении(Элемент)
	
	Запись.ДоступнаПометкаУдаления = ДоступностьПометкиУдаления();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФайл(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьЗагрузкуФайла", ЭтотОбъект);
	НачатьПомещениеФайла(ОписаниеОповещения);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ДоступнаПометкаУдаления = ДоступностьПометкиУдаления();
	
	Если Запись.ВидОбъекта = ПримитивныеДанные Тогда 
		ТекущийОбъект.ПроизвольныйОбъект = ПримитывныеДанныеЗначение;
	ИначеЕсли Запись.ВидОбъекта = СсылочныйОбъект Тогда 
		ТекущийОбъект.ПроизвольныйОбъект = СсылочныйОбъектЗначение;
	ИначеЕсли Не(ПустаяСтрока(АдресВременногоХранилищаФайла)) Тогда 
		ТекущийОбъект.ХранилищеЗначения = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресВременногоХранилищаФайла));
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ДоступностьПометкиУдаления()
	
	Если Запись.ВидОбъекта = Перечисления.USAC_ВидыПроизвольныхОбъектов.СсылочныйОбъект 
		И Не(Перечисления.ТипВсеСсылки().СодержитТип(ТипЗнч(Запись.ПроизвольныйОбъект))) Тогда 	
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;	

КонецФункции

&НаКлиенте
Процедура УстановитьВидимостьДанныхПроизвольноОбъекта()
	
	Если Запись.ВидОбъекта = ПримитивныеДанные Тогда 
		Элементы.ПримитывныеДанныеЗначение.Видимость	= Истина;
		Элементы.СсылочныйОбъектЗначение.Видимость		= Ложь;
		Элементы.ФормаЗагрузитьФайл.Видимость			= Ложь;
	ИначеЕсли Запись.ВидОбъекта = СсылочныйОбъект Тогда 
		Элементы.ПримитывныеДанныеЗначение.Видимость	= Ложь;
		Элементы.СсылочныйОбъектЗначение.Видимость		= Истина;
		Элементы.ФормаЗагрузитьФайл.Видимость			= Ложь;	
	ИначеЕсли Запись.ВидОбъекта = ХранилищеЗначения Тогда 
		Элементы.ПримитывныеДанныеЗначение.Видимость	= Ложь;
		Элементы.СсылочныйОбъектЗначение.Видимость		= Ложь;
		Элементы.ФормаЗагрузитьФайл.Видимость			= Истина;
	Иначе
		Элементы.ПримитывныеДанныеЗначение.Видимость	= Ложь;
		Элементы.СсылочныйОбъектЗначение.Видимость		= Ложь;
		Элементы.ФормаЗагрузитьФайл.Видимость			= Ложь;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьЗагрузкуФайла(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт

	Если Результат Тогда 
		АдресВременногоХранилищаФайла = Адрес;
		Файл = Новый Файл(ВыбранноеИмяФайла);
		Запись.ОписаниеОбъекта = Запись.ОписаниеОбъекта + ?(ПустаяСтрока(Запись.ОписаниеОбъекта), "", Символы.ПС + Символы.ПС)
			+ "Описание файла: " + Символы.ПС
			+ "Имя: " + Строка(Файл.ИмяБезРасширения) + Символы.ПС
			+ "Расширение: " + Строка(Файл.Расширение) + Символы.ПС
			+ "Адрес: " + Строка(Файл.ПолноеИмя) + Символы.ПС
			+ "Дата загрузки: " + Формат(ТекущаяДата(), "ДЛФ=Д") + Символы.ПС
			+ "Время загрузки: " + Формат(ТекущаяДата(), "ДЛФ=В") + Символы.ПС;
	КонецЕсли;	
	
КонецПроцедуры	

#КонецОбласти
